Repository: ErHaWeb/feed_display
Catalog: Resources/Private/Language/*.locallang_*.xlf
Languages: de, fr

# pi1_title
source: Feed Display
de: Feed-Anzeige
fr: Affichage de flux

# pi1_plus_wiz_description
source: RSS/Atom web feed parsing and frontend display based on Extbase/Fluid
de: RSS/Atom-Webfeed-Parsing und Frontend-Anzeige auf Basis von Extbase/Fluid
fr: Analyses de flux web RSS/Atom et affichage frontal basé sur Extbase/Fluid

# flexform.sheet_general.title
source: General
de: Allgemein
fr: Général

# flexform.sheet_general.description
source: These are general settings for the frontend display of the feed. If no value is given, then the value of the TypoScript configuration is used by default.
de: Dies sind allgemeine Einstellungen für die Frontend-Anzeige des Feeds. Wenn kein Wert angegeben wird, wird standardmäßig der Wert der TypoScript-Konfiguration verwendet.
fr: Il s'agit des paramètres généraux pour l'affichage frontal du flux. Si aucune valeur n'est donnée, la valeur de la configuration TypoScript est utilisée par défaut.

# flexform.feedUrl.label
source: Feed URL
fr: URL du flux

# flexform.feedUrl.description
source: URL that is fetched by the service (empty = Defined by TypoScript)
de: URL, die vom Dienst abgerufen wird (leer = von TypoScript definiert)
fr: URL récupérée par le service (vide = définie par TypoScript)

# flexform.maxFeedCount.label
source: Max. items
de: Max. Artikel
fr: Nombre maximal d'éléments

# flexform.maxFeedCount.description
source: Maximum feed items to show (0 or empty = Defined by TypoScript)
de: Maximal anzuzeigende Feed-Elemente (0 oder leer = von TypoScript festgelegt)
fr: Nombre maximal d'éléments du flux à afficher (0 ou vide = défini par TypoScript)

# flexform.maxContentLength.label
source: Max. content length
de: Max. Länge des Inhalts
fr: Longueur maximale du contenu

# flexform.maxContentLength.description
source: Crop the characters of the feed content to the configured length (0 or empty = Defined by TypoScript)
de: Beschneidet die Zeichen des Feed-Inhalts auf die konfigurierte Länge (0 oder leer = Definiert durch TypoScript)
fr: Tronquer les caractères du contenu du flux à la longueur configurée (0 ou vide = défini par TypoScript)

# flexform.maxHeaderLength.label
source: Max. header length
de: Max. Länge der Kopfzeile
fr: Longueur maximale de l'en-tête

# flexform.maxHeaderLength.description
source: Crop the characters of the feed header to the configured length (0 or empty = Defined by TypoScript)
de: Beschneidet die Zeichen des Feed-Headers auf die konfigurierte Länge (0 oder leer = Definiert durch TypoScript)
fr: Tronquer les caractères de l'en-tête du flux à la longueur configurée (0 ou vide = défini par TypoScript)

# flexform.linkTarget.label
source: Target
de: Link-Ziel
fr: Cible

# flexform.linkTarget.description
source: Target attribute to define the feed link behavior
de: Konfiguration des Link-Verhaltens anhand des target-Attributs
fr: Attribut cible pour définir le comportement du lien du flux

# flexform.linkTarget.I.default
source: Defined by TypoScript (default)
de: Definiert durch TypoScript (Standard)
fr: Défini par TypoScript (par défaut)

# flexform.linkTarget.I.blank
source: Opens in a new window or tab
de: Wird in einem neuen Fenster oder Tab geöffnet
fr: S'ouvre dans une nouvelle fenêtre ou un nouvel onglet

# flexform.linkTarget.I.self
source: Opens in the same frame as it was clicked
de: Öffnet sich in demselben Rahmen, in dem es angeklickt wurde
fr: S'ouvre dans le même cadre que celui où il a été cliqué

# flexform.linkTarget.I.parent
source: Opens in the parent frame
de: Öffnet sich im übergeordneten Rahmen
fr: S'ouvre dans le cadre parent

# flexform.linkTarget.I.top
source: Opens in the full body of the window
de: Öffnet sich in der gesamten Anzeigefläche des Fensters
fr: S'ouvre dans le corps complet de la fenêtre

# flexform.logoMaxWidth.label
source: Logo max. width
de: Max. Breite des Logos
fr: Largeur maximale du logo

# flexform.logoMaxWidth.description
source: Maximum width of the feeds logo image (0 or empty = Defined by TypoScript)
de: Maximale Breite des Feeds-Logo-Bildes (0 oder leer = von TypoScript festgelegt)
fr: Largeur maximale de l'image du logo du flux (0 ou vide = défini par TypoScript)

# flexform.logoMaxHeight.label
source: Logo max. height
de: Max. Höhe des Logos
fr: Hauteur maximale du logo

# flexform.logoMaxHeight.description
source: Maximum height of the feeds logo image (0 or empty = Defined by TypoScript)
de: Maximale Höhe des Feeds-Logo-Bildes (0 oder leer = von TypoScript definiert)
fr: Hauteur maximale de l'image du logo du flux (0 ou vide = défini par TypoScript)

# flexform.feedIconMaxWidth.label
source: Feed icon max. width
de: Maximale Breite des Feed-Icons
fr: Largeur maximale de l'icône du flux

# flexform.feedIconMaxWidth.description
source: Maximum width of the feeds icon image (0 or empty = Defined by TypoScript)
de: Maximale Breite des Feeds-Icon-Bildes (0 oder leer = von TypoScript festgelegt)
fr: Largeur maximale de l'image de l'icône du flux (0 ou vide = défini par TypoScript)

# flexform.feedIconMaxHeight.label
source: Feed icon max. height
de: Max. Höhe des Feed-Icons
fr: Hauteur maximale de l'icône du flux

# flexform.feedIconMaxHeight.description
source: Maximum height of the feeds icon image (0 or empty = Defined by TypoScript)
de: Maximale Höhe des Feeds-Icon-Bildes (0 oder leer = von TypoScript festgelegt)
fr: Hauteur maximale de l'image de l'icône du flux (0 ou vide = défini par TypoScript)

# flexform.errorMessage.label
source: Error message
de: Fehlermeldung
fr: Message d'erreur

# flexform.errorMessage.description
source: This message is displayed if no feed items could be fetched (empty = Defined by TypoScript)
de: Diese Meldung wird angezeigt, wenn keine Feed-Artikel abgeholt werden konnten (leer = von TypoScript definiert)
fr: Ce message s'affiche si aucun élément de flux ne peut être récupéré (vide = défini par TypoScript)

# flexform.sheet_advanced.title
source: Advanced
de: Erweitert
fr: Avancé

# flexform.sheet_advanced.description
source: These are advanced settings. If you are unsure, simply use the default values here. If no value is given, then the value of the TypoScript configuration is used by default.
de: Dies sind erweiterte Einstellungen. Wenn Sie unsicher sind, verwenden Sie einfach die Standardwerte. Wenn kein Wert angegeben wird, wird standardmäßig der Wert aus der TypoScript-Konfiguration verwendet.
fr: Ce sont des paramètres avancés. Si vous n'êtes pas sûr, utilisez simplement les valeurs par défaut ici. Si aucune valeur n'est donnée, la valeur de la configuration TypoScript est utilisée par défaut.

# flexform.dateFormat.label
source: Date format
de: Datumsformat
fr: Format de date

# flexform.dateFormat.description
source: Use PHP's strftime() function format (empty = Defined by TypoScript)
de: Verwenden Sie das Format der PHP-Funktion strftime() (leer = von TypoScript definiert)
fr: Utilisez le format de la fonction strftime() de PHP (vide = défini par TypoScript)

# flexform.stripTags.label
source: Strip tags
de: Tags entfernen
fr: Supprimer les balises

# flexform.stripTags.description
source: Remove HTML tags from the feed content
de: HTML-Tags aus dem Feed-Inhalt entfernen
fr: Supprimez les balises HTML du contenu du flux

# flexform.stripTags.I.yes
source: yes
de: Ja
fr: oui

# flexform.stripTags.I.no
source: no
de: Nein
fr: non

# flexform.cacheDuration.label
source: Feed cache
fr: Cache du flux

# flexform.cacheDuration.description
source: Time in seconds in which the data is to be read from the cache until the next renewal of the cache. (0 = no cache, empty = Defined by TypoScript)
de: Zeit in Sekunden, in der die Daten bis zur nächsten Erneuerung des Caches aus dem Cache gelesen werden sollen. (0 = kein Cache, leer = durch TypoScript definiert)
fr: Temps en secondes pendant lequel les données doivent être lues dans le cache jusqu'à la prochaine mise à jour du cache. (0 = pas de cache, vide = défini par TypoScript)

# flexform.placeholder.feed
source: Defined by Feed or TypoScript (default)
de: Definiert durch Feed oder TypoScript (Standard)
fr: Défini par le flux ou TypoScript (par défaut)

# flexform.placeholder.typoscript
source: Defined by TypoScript (default)
de: Definiert durch TypoScript (Standard)
fr: Défini par TypoScript (par défaut)

# flexform.sheet_getFields.title
source: Get Fields
de: Felder abrufen
fr: Obtenir les champs

# flexform.sheet_getFields.description
source: Select here which fields from the feed and feed items should be read using the SimplePie library and should be available as variables in the fluid template. If no fields were selected, then the TypoScript configuration is used.
de: Wählen Sie hier aus, welche Felder aus dem Feed und den Feed-Elementen mit Hilfe der SimplePie-Bibliothek gelesen werden und als Variablen in der Fluid-Vorlage zur Verfügung stehen sollen. Wurden keine Felder ausgewählt, so wird die TypoScript-Konfiguration verwendet.
fr: Sélectionnez ici les champs du flux et des éléments du flux qui doivent être lus à l'aide de la bibliothèque SimplePie et qui doivent être disponibles en tant que variables dans le modèle fluid. Si aucun champ n'a été sélectionné, la configuration TypoScript est utilisée.

# flexform.getFields.feed.label
source: Get fields from feed
de: Felder aus Feed abrufen
fr: Obtenir les champs du flux

# flexform.getFields.feed.description
source: Selection of the fields to be read from the feed.
de: Auswahl der Felder, die aus dem Feed gelesen werden sollen.
fr: Sélection des champs à lire à partir du flux.

# flexform.getFields.group.feed
source: Feed
fr: Flux

# flexform.getFields.feed.I.author
source: Author
de: Autor
fr: Auteur

# flexform.getFields.feed.I.authors
source: Authors
de: Autoren
fr: Auteurs

# flexform.getFields.feed.I.contributor
source: Contributor
de: Mitwirkende(r)
fr: Contributeur

# flexform.getFields.feed.I.contributors
source: Contributors
de: Mitwirkende
fr: Contributeurs

# flexform.getFields.feed.I.copyright
source: Copyright
fr: Droit d'auteur

# flexform.getFields.feed.I.encoding
source: Encoding
de: Kodierung
fr: Encodage

# flexform.getFields.feed.I.items
source: Items
de: Elemente
fr: Éléments

# flexform.getFields.feed.I.item_quantity
source: Item_quantity
de: Zahl der Elemente
fr: Quantité de l'élément

# flexform.getFields.feed.I.language
source: Language
de: Sprache
fr: Langue

# flexform.getFields.feed.I.link
source: Link
fr: Lien

# flexform.getFields.feed.I.links
source: Links
fr: Liens

# flexform.getFields.feed.I.permalink
source: Permalink
fr: Permalien

# flexform.getFields.feed.I.title
source: Title
de: Titel
fr: Titre

# flexform.getFields.feed.I.image_height
source: Image Height
de: Bildhöhe
fr: Hauteur de l'image

# flexform.getFields.feed.I.image_link
source: Image Link
de: Bild-Link
fr: Lien de l'image

# flexform.getFields.feed.I.image_title
source: Image Title
de: Bild-Titel
fr: Titre de l'image

# flexform.getFields.feed.I.image_url
source: Image URL
de: URL des Bildes
fr: URL de l'image

# flexform.getFields.feed.I.image_width
source: Image Width
de: Bildbreite
fr: Largeur de l'image

# flexform.getFields.feed.I.all_discovered_feeds
source: All Discovered Feeds
de: Alle entdeckten Feeds
fr: Tous les flux découverts

# flexform.getFields.feed.I.subscribe_url
source: Subscribe URL
de: URL zum Abonnieren
fr: URL d'abonnement

# flexform.getFields.items.label
source: Get fields from feed items
de: Felder aus Feed abrufen
fr: Obtenir les champs des éléments du flux

# flexform.getFields.items.description
source: Selection of the fields to be read from the feed items.
de: Auswahl der Felder, die aus dem Feed gelesen werden sollen.
fr: Sélection des champs à lire à partir des éléments du flux.

# flexform.getFields.group.items
source: Items
de: Elemente
fr: Éléments

# flexform.getFields.items.I.author
source: Author
de: Autor
fr: Auteur

# flexform.getFields.items.I.authors
source: Authors
de: Autoren
fr: Auteurs

# flexform.getFields.items.I.categories
source: Categories
de: Kategorien
fr: Catégories

# flexform.getFields.items.I.category
source: Category
de: Kategorie
fr: Catégorie

# flexform.getFields.items.I.content
source: Content
de: Inhalt
fr: Contenu

# flexform.getFields.items.I.contributor
source: Contributor
de: Mitwirkende(r)
fr: Contributeur

# flexform.getFields.items.I.contributors
source: Contributors
de: Mitwirkende
fr: Contributeurs

# flexform.getFields.items.I.copyright
source: Copyright
fr: Droit d'auteur

# flexform.getFields.items.I.date|U
source: Date (with parameter "U")
de: Datum (mit Parameter "U")
fr: Date (avec paramètre "U")

# flexform.getFields.items.I.enclosure
source: Enclosure
de: Anhang
fr: Enceinte

# flexform.getFields.items.I.enclosures
source: Enclosures
de: Anhänge
fr: Enceinte

# flexform.getFields.items.I.feed
source: Feed
fr: Flux

# flexform.getFields.items.I.link
source: Link
fr: Lien

# flexform.getFields.items.I.links
source: Links
fr: Liens

# flexform.getFields.items.I.local_date|
source: Local Date (with empty parameter)
de: Lokales Datum (mit leerem Parameter)
fr: Date locale (avec paramètre vide)

# flexform.getFields.items.I.permalink
source: Permalink
fr: Permalien

# flexform.getFields.items.I.title
source: Title
de: Titel
fr: Titre

# constants.customcategory.plugin.tx_feeddisplay_pi1
source: Feed Display
de: Feed-Anzeige
fr: Affichage de flux

# constants.subcategory.general
source: General
de: Allgemein
fr: Général

# constants.subcategory.advanced
source: Advanced
de: Erweitert
fr: Avancé

# constants.subcategory.getFields
source: Fields to get from Feed and Items
de: Felder, die von Feed und Items abgerufen werden
fr: Champs à récupérer du flux et des éléments

# flexform.getFields.feed.I.description
source: Description
de: Beschreibung

# flexform.getFields.feed.I.type
source: Type
de: Typ

# flexform.getFields.feed.I.latitude
source: Latitude
de: Breitengrad

# flexform.getFields.feed.I.longitude
source: Longitude
de: Längengrad

# flexform.getFields.feed.I.base
source: Base
de: Basis

# flexform.getFields.items.I.description
source: Description
de: Beschreibung

# flexform.getFields.items.I.source
source: Source
de: Quelle

# flexform.getFields.items.I.latitude
source: Latitude
de: Breitengrad

# flexform.getFields.items.I.longitude
source: Longitude
de: Längengrad

# flexform.getFields.items.I.base
source: Base
de: Basis
